/* drivers/input/keyboard/lge_touch_driver.c
 *
 * Copyright (C) 2011 LGE. 
 * 
 * Writer: yehan.ahn@lge.com
 *
 * Most lines are copied from touch_driver of STAR-P999.
 * That is written by joseph.jung@lge.com and taewan.kim@lge.com.
 * Please check the STAR-P999 or contact writers if you want more information about original source code.
 *
 * This file is used by LGE_touch_deriver.c.
 * it is related with specific touch-device.
 * You should check the document or contact the writer in order to understand whole process.
 *
 * This software is licensed under the terms of the GNU General Public
 * License version 2, as published by the Free Software Foundation, and
 * may be copied, distributed, and modified under those terms.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 */
#include <linux/module.h>
#include <linux/delay.h>
#include <linux/earlysuspend.h>
#include <linux/hrtimer.h>
#include <linux/i2c.h>
#include <linux/input.h>
#include <linux/kthread.h>
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/slab.h>
#include <linux/platform_device.h>
#include <mach/gpio.h>
#include <linux/semaphore.h>
#include <linux/irq.h>
#include <linux/freezer.h>

#include <linux/lge_touch_synaptics.h>
#include <linux/lge_touch_driver.h>

#include <linux/bd6084_bl.h>
//                                                   
#if defined (CONFIG_SU880) || defined (CONFIG_KU8800) || defined (CONFIG_LU8800) || defined (CONFIG_KS1103)
#include <../gpio-names.h>
#endif

//                                                    
#if defined (SYNAPTICS_TOUCH_FW_UPGRADE)
#include <linux/syscalls.h>
#include <linux/fs.h>
#include <linux/uaccess.h>
#endif
//                                                    

//#define STAR_MELT_SUPPORT
#define STAR_FW_UPGRADE
#define STAR_TOUCH_GRIP_SUPPRESSION
/* 
                           
                                                                 
 */
#define LGE_NOMELT
 
#define GET_BIT_MASK(_finger_state_reg)	\
		(_finger_state_reg[2] & 0x04)<<7 | (_finger_state_reg[2] & 0x01)<<8 |	\
		(_finger_state_reg[1] & 0x40)<<1 | (_finger_state_reg[1] & 0x10)<<2 |(_finger_state_reg[1] & 0x04)<<3 | (_finger_state_reg[1] & 0x01)<<4 |	\
		(_finger_state_reg[0] & 0x40)>>3 | (_finger_state_reg[0] & 0x10)>>2 |(_finger_state_reg[0] & 0x04)>>1 | (_finger_state_reg[0] & 0x01)

#define GET_INDEX_FROM_MASK(_index, _bit_mask)	\
for(; !((_bit_mask>>_index)&0x01) && _index <= SYNAPTICS_FINGER_MAX; _index++);	\
if(_index <= SYNAPTICS_FINGER_MAX) _bit_mask &= ~(_bit_mask & (1<<(_index)));


#define TS_SNTS_GET_X_POSITION(_high_reg, _low_reg) \
		( ((u16)((_high_reg << 4) & 0x000007F0) | (u16)(_low_reg&0x0F)) * (LGE_TOUCH_RESOLUTION_X - 1) / 1036)
#define TS_SNTS_GET_Y_POSITION(_high_reg, _low_reg) \
		( ((u16)((_high_reg << 4) & 0x000007F0) | (u16)((_low_reg >> 4) & 0x0F)) * (LGE_TOUCH_RESOLUTION_Y - 1) / 1728)
#define TS_SNTS_GET_WIDTH(_width) \
		((((_width & 0xf0) >> 4) - (_width & 0x0f)) > 0)? (_width & 0xf0) >> 4 : _width & 0x0f
#define TS_SNTS_GET_PRESSURE(_pressure) \
		_pressure

#if defined (LGE_NOMELT)
#define TS_SNTS_GET_LOWDATA_X_POSITION(_high_reg, _low_reg) \
		((u16)((_high_reg << 4) & 0x000007F0) | (u16)(_low_reg&0x0F))
#define TS_SNTS_GET_LOWDATA_Y_POSITION(_high_reg, _low_reg) \
		((u16)((_high_reg << 4) & 0x000007F0) | (u16)((_low_reg >> 4) & 0x0F))
#endif

enum {X_HIGH_POSITION=0, Y_HIGH_POSITION, XY_LOW_POSITION, XY_WIDTH, PRESSURE};

#define ADJUST_LEVEL 5
#define SQUARE(x)		((x) * (x))

const u16 ADJUST_FACTOR_LEVEL[ADJUST_LEVEL] = {8,6,4,2,1};
const u16 ADJUST_BASIS_LEVEL[ADJUST_LEVEL] = {5,11,19,29,40};
const u16 ADJUST_FACTOR_BASE = 4;

#if defined (CONFIG_SU880) || defined (CONFIG_KU8800) || defined (CONFIG_LU8800) || defined (CONFIG_KS1103)    
#define IS_MENU(_x)			(_x > 15  && _x < 145)
#define IS_HOME(_x)			(_x > 175 && _x < 305)
#define IS_BACK(_x)			(_x > 335 && _x < 465)
#define IS_SEARCH(_x)		(_x < 0)
#define IS_PANEL(_y)		(_y >= 0  && _y <= 800)
#else
#define IS_MENU(_x)			(_x > 15  && _x < 115)
#define IS_HOME(_x)			(_x > 145 && _x < 225)
#define IS_BACK(_x)			(_x > 255 && _x < 335)
#define IS_SEARCH(_x)		(_x > 365 && _x < 465)
#define IS_PANEL(_y)		(_y >= 0  && _y <= 800)
#endif
struct synaptics_ts_data {
	struct touch_device_caps caps;
	struct i2c_client *client;
	struct input_dev *input_dev;
	struct semaphore sem;
	struct task_struct*	task;
	u32 gpio;
	u32 irq_gpio;
	u32 flags;
	int (*power)(char* reg_id, bool on);
	u32 touch;
//                                                    
#if defined (SYNAPTICS_TOUCH_FW_VERSION)
	char fw_rev;
#endif
//                                                    
//                                                    
#if defined (SYNAPTICS_TOUCH_FW_UPGRADE)
	char fw_path[256];
#endif
//                                                    
};

static const struct touch_device_caps Synaptics_Capabilities =
{
	1,	//IsMultiTouchSupported
	1, 	//isButtonSupported
	10,	//MaxNumberOfFingerCoordReported;
	0,	//IsRelativeDataSupported
	0,	//MaxNumberOfRelativeCoordReported
	15,	//MaxNumberOfWidthReported
	0xFF,	//MaxNumberOfPressureReported
	0,	// Gesture
	0,	//IsWidthSupported
	0,	//IsPressureSupported, mandatory for multi-touch
	0,	//IsFingersSupported
	0,	//XMinPosition
	0,	//YMinPosition
	LGE_TOUCH_RESOLUTION_X-1,	//XMaxPosition
	LGE_TOUCH_RESOLUTION_Y-1,	//YMaxPosition
	0,
};

struct ts_sensor_data
{
	u8 device_status_reg;						//0x13
	u8 interrupt_status_reg;					//0x14
	u8 finger_state_reg[3];						//0x15~0x17

	u8 fingers_data[SYNAPTICS_FINGER_MAX][5];				//0x18 ~ 0x49

	u8 gesture_flag0;							//0x4A
	u8 gesture_flag1;							//0x4B
	u8 pinch_motion_X_flick_distance;			//0x4C
	u8 rotation_motion_Y_flick_distance;		//0x4D
	u8 finger_separation_flick_time;			//0x4E
};

//                                                    
#if defined (SYNAPTICS_TOUCH_FW_UPGRADE)
struct synaptics_fw_data {
	unsigned char *image_bin;
	unsigned long image_size;
};
#endif
//                                                    

#if defined (LGE_NOMELT)
static char mode=1,numfinger=0, reportcnt=0, tapcount=0;
static int current_data_x, current_data_y, prex, prey, firstx, firsty;
#endif

static struct ts_sensor_data ts_reg_data={0};

#ifdef STAR_FW_UPGRADE
#if defined(CONFIG_KS1001) || defined (CONFIG_LU6500)
#include "synaptics_ts_firmware_TM1765.h"
#else if defined (CONFIG_SU880) || defined (CONFIG_KU8800) || defined (CONFIG_LU8800) || defined (CONFIG_KS1103)
#include "synaptics_ts_firmware_TM1962.h"
#endif

static int synaptics_ts_fw_upgrade(struct synaptics_ts_data* hTouch);
#endif

//                                                  
#if 1
static bool synaptics_ts_hw_reset(struct synaptics_ts_data* hTouch);
#else
